:PROPERTIES:
:ID:       a6334ec2-fd14-4ba9-898c-675ff61d6e3f
:END:
#+title: elisp-lang-fn
#+date: [2024-07-11 四]
#+last_modified: [2024-07-11 四 22:29]

|------------------+--------------------------------------------+---------------------------+-----+----------------------------------------------------|
| API              | Format                                     | Params                    | Ret | Note                                               |
|------------------+--------------------------------------------+---------------------------+-----+----------------------------------------------------|
| <<Define>>       |                                            |                           |     |                                                    |
|------------------+--------------------------------------------+---------------------------+-----+----------------------------------------------------|
| definition       | defun name args body                       | name:symbol               |     |                                                    |
|                  |                                            | args:symbol               |     |                                                    |
|                  |                                            | body:block                |     |                                                    |
|------------------+--------------------------------------------+---------------------------+-----+----------------------------------------------------|
| alias            | alias name body                            | name:symbol               |     |                                                    |
|                  |                                            | body:block                |     |                                                    |
|------------------+--------------------------------------------+---------------------------+-----+----------------------------------------------------|
*** Basic Form
#+NAME: m-multiply-by-seven 
#+BEGIN_SRC emacs-lisp 
    (defun m-multiply-by-seven (number)
	"
	Return The NUMBER multiplied by seven.
	  Example:
	  `(multiply-by-seven 3) ;21`"
       (* 7 number))
#+END_SRC

#+RESULTS: m-multiply-by-seven
: m-multiply-by-seven


#+NAME: m-call-multiply-by-seven 
#+BEGIN_SRC emacs-lisp
  (m-multiply-by-seven 3)
#+END_SRC

#+RESULTS: m-call-multiply-by-seven
: 21



